#include <string.h>

#include "tetris.h"

/**
 * @ingroup Screens
 * @brief Функция нанесения заставки перед началом игры на поле
 * @param[in] int** Указатель на поле игры
 * @return Функция не возвращает значения
 */
void logo_start(int **field) {
  int logo[field_height][field_width] = {
      {0, 2, 2, 2, 2, 2, 0, 0, 0, 0}, {0, 0, 0, 2, 0, 3, 3, 3, 3, 0},
      {0, 0, 0, 2, 0, 3, 0, 0, 0, 0}, {0, 0, 0, 2, 0, 3, 3, 3, 0, 0},
      {0, 0, 0, 2, 0, 3, 0, 0, 0, 0}, {0, 0, 0, 0, 0, 3, 3, 3, 3, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}, {0, 4, 4, 4, 4, 4, 0, 0, 0, 0},
      {0, 0, 0, 4, 0, 5, 5, 5, 5, 0}, {0, 0, 0, 4, 0, 5, 0, 0, 5, 0},
      {0, 0, 0, 4, 0, 5, 5, 5, 0, 0}, {0, 0, 0, 4, 0, 5, 0, 0, 5, 0},
      {0, 0, 0, 0, 0, 5, 0, 0, 5, 0}, {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 1, 0, 0, 0, 0, 0, 0}, {0, 0, 0, 1, 0, 6, 6, 6, 6, 0},
      {0, 0, 0, 1, 0, 6, 0, 0, 0, 0}, {0, 0, 0, 1, 0, 6, 6, 6, 6, 0},
      {0, 0, 0, 1, 0, 0, 0, 0, 6, 0}, {0, 0, 0, 0, 0, 6, 6, 6, 6, 0}};
  for (int row = 0; row < field_height; row++) {
    memcpy(field[row], logo[row], field_width * sizeof(int));
  }
}
